app/controllers/places_controller.rb

  def index
    @places = Place.all
---
SELECT * FROM `places`

  def create
    @place = Place.new(params[:place])
    if @place.save
---
INSERT INTO "places" ("name", "updated_at", "url", "phone_number", "lng", "address", "lat", "created_at") VALUES(NULL, '2009-08-19 19:03:09', NULL, NULL, NULL, NULL, NULL, '2009-08-19 19:03:09')

  def edit
    @place = Place.find(params[:id])
---
SELECT * FROM "places" WHERE ("places"."id" = 953125641)

  def update
    @place = Place.find(params[:id])
    if @place.update_attributes(params[:place])
---
SELECT * FROM "places" WHERE ("places"."id" = 953125641)
UPDATE `places` SET `updated_at` = '2009-07-08 21:58:33', `url` = '', `name` = 'Home' WHERE `id` = 1