app/controllers/placemarks_controller.rb

SELECT * FROM `placemarks`
---
  def index
    @placemarks = Placemark.paginate :page => params[:page], :per_page => 10

INSERT INTO `places` (`name`, `updated_at`, `url`, `phone_number`, `lng`, `address`, `lat`, `created_at`) VALUES('Yakitori Taisho', '2009-08-14 15:34:00', 'http://nymag.com/listings/restaurant/yakitori-taisho/', '(212) 228-5086', -73.989229, 'Frnt 1 5 Saint Marks Pl, New York, NY ', 40.729534, '2009-08-14 15:34:00')
INSERT INTO `placemarks` (`rating`, `place_id`, `updated_at`, `user_id`, `alias`, `created_at`) VALUES(NULL, 2, '2009-08-12 15:28:35', 1, '', '2009-08-12 15:28:35')
---
  def create
    params[:placemark][:user_id] = current_user.id

    @place = Place.new(params[:place])
    @place.rate(params[:stars], current_user, params[:dimension])
    @placemark = Placemark.new(params[:placemark])

    if @place.save
      @placemark.place_id = @place.id
    else
      render :action => 'new' and return
    end

    if @placemark.save

SELECT * FROM "placemarks" WHERE ("placemarks"."id" = 953125641)
---
  def edit
    @placemark = Placemark.find(params[:id])

SELECT * FROM "placemarks" WHERE ("placemarks"."id" = 953125641)
UPDATE `placemarks` SET `alias` = 'Home', `updated_at` = '2009-08-12 20:58:52' WHERE `id` = 3
UPDATE `places` SET `address` = 'The East River at 30th Street New York', `updated_at` = '2009-08-12 18:29:45', `name` = '<b>Water Club</b>' WHERE `id` = 3
---
  def update
    @placemark = Placemark.find(params[:id])
    if @placemark.update_attributes(params[:placemark]) and \
      @placemark.place.update_attributes(params[:place])

SELECT * FROM `placemarks` WHERE (`placemarks`.`id` = 5)
DELETE FROM `placemarks` WHERE `id` = 5
---
  def destroy
    @placemark = Placemark.find(params[:id])
    @placemark.destroy