app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`updated_at`, `username`, `password_salt`, `password_hash`, `email`, `created_at`) VALUES('2009-06-09 19:59:29', 'chawei', '0b8409c867d4ddb0ec0895a3c59926d3cbc66d0f', 'a6006e897adb9428bb27d143633e750551cd7625', 'chawei.hsu@gmail.com', '2009-06-09 19:59:29')

  def update
    @user = current_user
    if @user.update_attributes(params[:user])
---
UPDATE `users` SET `last_name` = 'Hsu', `first_name` = 'David', `updated_at` = '2009-08-24 21:40:55' WHERE `id` = 1