app/controllers/welcome_controller.rb

  def index
    unless current_user.nil?
      @placemarks = current_user.placemarks.paginate :page => params[:page], :per_page => 10
---
SELECT * FROM `placemarks` WHERE (`placemarks`.user_id = 1)
SELECT `places`.* FROM `places` INNER JOIN `placemarks` ON `places`.id = `placemarks`.place_id WHERE ((`placemarks`.user_id = 1))